# CannotPasteAlignedError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteAlignedError Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't Paste Align these elements in this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteAlignedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteAlignedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteAlignedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace